[NoCoverage] MethodExpression
src/db_fill/aditional_func/filterfunc.ts:5:5
 
 export const extractTopicsFromHistory = (historyData: History): string[] => {
   const topics = historyData.flatMap((section: HistorySection) =>
-    section.tasks
-      .map((task: HistoryTask) => task.topic)
-      .filter((topic) => topic && typeof topic === 'string'),
+    section.tasks.map((task: HistoryTask) => task.topic),
   );
 

[NoCoverage] ArrowFunction
src/db_fill/aditional_func/filterfunc.ts:7:15
   const topics = historyData.flatMap((section: HistorySection) =>
     section.tasks
       .map((task: HistoryTask) => task.topic)
-      .filter((topic) => topic && typeof topic === 'string'),
+      .filter(() => undefined),
   );
 

[NoCoverage] ConditionalExpression
src/db_fill/aditional_func/filterfunc.ts:7:35
   const topics = historyData.flatMap((section: HistorySection) =>
     section.tasks
       .map((task: HistoryTask) => task.topic)
-      .filter((topic) => topic && typeof topic === 'string'),
+      .filter((topic) => topic && true),
   );
 
