[Killed] BlockStatement
src/auth/strategies/jwt.strategy.ts:14:26
     });
   }
 
-  validate(payload: any) {
-    return payload; // payload: { sub, email }
-  }
+  validate(payload: any) {}
 }
 
killedBy: Auth E2E 3. getMe
statusReason: Error: expected 200 "OK", got 401 "Unauthorized"
