[NoCoverage] ConditionalExpression
src/study-plan/gpt_settings/gptReqFunc.ts:6:9
 let client: OpenAI | null = null;
 
 function getOpenAIClient() {
-    if (!process.env.GPT_API_KEY) {
+    if (false) {
         throw new Error("GPT_API_KEY is not set");
     }

[NoCoverage] BooleanLiteral
src/study-plan/gpt_settings/gptReqFunc.ts:6:9
 let client: OpenAI | null = null;
 
 function getOpenAIClient() {
-    if (!process.env.GPT_API_KEY) {
+    if (process.env.GPT_API_KEY) {
         throw new Error("GPT_API_KEY is not set");
     }
