[NoCoverage] BlockStatement
src/auth/strategies/refresh-jwt.strategy.ts:18:31
     });
   }
 
-  validate(req, payload: any) {
-    const refreshToken = req.get('authorization').replace('Bearer ', '');
-    return { ...payload, refreshToken };
-    // payload: { sub, email }
-  }
+  validate(req, payload: any) {}
 }
 

[NoCoverage] StringLiteral
src/auth/strategies/refresh-jwt.strategy.ts:19:59
   }
 
   validate(req, payload: any) {
-    const refreshToken = req.get('authorization').replace('Bearer ', '');
+    const refreshToken = req.get('authorization').replace("", '');
     return { ...payload, refreshToken };
     // payload: { sub, email }

[NoCoverage] StringLiteral
src/auth/strategies/refresh-jwt.strategy.ts:19:34
   }
 
   validate(req, payload: any) {
-    const refreshToken = req.get('authorization').replace('Bearer ', '');
+    const refreshToken = req.get("").replace('Bearer ', '');
     return { ...payload, refreshToken };
     // payload: { sub, email }

[NoCoverage] ObjectLiteral
src/auth/strategies/refresh-jwt.strategy.ts:20:12
 
   validate(req, payload: any) {
     const refreshToken = req.get('authorization').replace('Bearer ', '');
-    return { ...payload, refreshToken };
+    return {};
     // payload: { sub, email }
   }
