[Killed] BlockStatement
src/mail/mail.controller.ts:12:50
   constructor(private readonly mailService: MailService) {}
 
   @Post('send-test')
-  async sendTestEmail(@Body() body: SendMailDto) {
-    const mailOptions: MailOptions = {
-      to: body.email,
-      subject: body.subject || 'Default Test Subject',
-      text: body.text || 'Default test text content.',
-      html: body.html,
-    };
-
-    const result = await this.mailService.sendMail(mailOptions, undefined, {
-      userId: body.userId,
-    });
-
-    return {
-      message: 'Test email successfully queued.',
-      details: result,
-    };
-  }
+  async sendTestEmail(@Body() body: SendMailDto) {}
 
   @Post('test-welcome')
killedBy: MailController sendTestEmail should call service.sendMail with strict DTO values
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"html": undefined, "subject": "Strict Subject", "text": "Strict Text Content", "to": "test@example.com"}, undefined, {"userId": "550e8400-e29b-41d4-a716-446655440000"}

Number of calls: 0

[Killed] LogicalOperator
src/mail/mail.controller.ts:15:16
   async sendTestEmail(@Body() body: SendMailDto) {
     const mailOptions: MailOptions = {
       to: body.email,
-      subject: body.subject || 'Default Test Subject',
+      subject: body.subject && 'Default Test Subject',
       text: body.text || 'Default test text content.',
       html: body.html,
killedBy: MailController sendTestEmail should call service.sendMail with strict DTO values
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "html": undefined,
-   "subject": "Strict Subject",

[Killed] LogicalOperator
src/mail/mail.controller.ts:16:13
     const mailOptions: MailOptions = {
       to: body.email,
       subject: body.subject || 'Default Test Subject',
-      text: body.text || 'Default test text content.',
+      text: body.text && 'Default test text content.',
       html: body.html,
     };
killedBy: MailController sendTestEmail should call service.sendMail with strict DTO values
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "html": undefined,
    "subject": "Strict Subject",

[Killed] ObjectLiteral
src/mail/mail.controller.ts:20:76
       html: body.html,
     };
 
-    const result = await this.mailService.sendMail(mailOptions, undefined, {
-      userId: body.userId,
-    });
+    const result = await this.mailService.sendMail(mailOptions, undefined, {});
 
     return {
killedBy: MailController sendTestEmail should call service.sendMail with strict DTO values
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"html": undefined, "subject": "Strict Subject", "text": "Strict Text Content", "to": "test@example.com"},
  undefined,
- Object {

[Killed] BlockStatement
src/mail/mail.controller.ts:31:60
   }
 
   @Post('test-welcome')
-  async testWelcomeEmail(@Body() body: TestWelcomeMailDto) {
-    await this.mailService.sendMail(
-      {
-        to: body.recipientEmail,
-        subject: 'Welcome to UniPrep! (Auth Bypass Test)',
-        text: 'Template-based email - please view with HTML support.',
-      },
-      'welcome',
-      {
-        userEmail: body.recipientEmail,
-        userId: body.userId,
-      },
-    );
-
-    return {
-      message: `Welcome email test successfully initiated to ${body.recipientEmail}.`,
-    };
-  }
+  async testWelcomeEmail(@Body() body: TestWelcomeMailDto) {}
 }
 
killedBy: MailController testWelcomeEmail should correctly map TestWelcomeMailDto properties to service call
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"subject": StringContaining "Welcome to UniPrep", "to": "newuser@example.com"}, "welcome", {"userEmail": "newuser@example.com", "userId": "550e8400-e29b-41d4-a716-446655440000"}

Number of calls: 0

[Killed] StringLiteral
src/mail/mail.controller.ts:35:18
     await this.mailService.sendMail(
       {
         to: body.recipientEmail,
-        subject: 'Welcome to UniPrep! (Auth Bypass Test)',
+        subject: "",
         text: 'Template-based email - please view with HTML support.',
       },
killedBy: MailController testWelcomeEmail should correctly map TestWelcomeMailDto properties to service call
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- ObjectContaining {"subject": StringContaining "Welcome to UniPrep", "to": "newuser@example.com"},
+ {"subject": "", "text": "Template-based email - please view with HTML support.", "to": "newuser@example.com"},
  "welcome",

[Survived] StringLiteral
src/mail/mail.controller.ts:36:15
       {
         to: body.recipientEmail,
         subject: 'Welcome to UniPrep! (Auth Bypass Test)',
-        text: 'Template-based email - please view with HTML support.',
+        text: "",
       },
       'welcome',
