[Killed] BlockStatement
src/flashcards/flashcards.controller.ts:15:5
     @Param('topicId') topicId: string,
     @Query('skip') skip: number = 0,
     @Query('take') take: number = DEFAULT_CARDS_TAKE,
-  ) {
-    return this.service.getFlashcardsByTopic(topicId, skip, take);
-  }
+  ) {}
 
   @Get('entry-test')
killedBy: FlashcardsController getFlashcardsByTopic should return flashcards for a given topic
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/flashcards/flashcards.controller.ts:24:5
     @Query('subjectId') subjectId?: string,
     @Query('skip') skip: number = 0,
     @Query('take') take: number = ENTRY_TEST_CARDS_NUMBER,
-  ) {
-    return await this.service.getEntryTestFlashcards(subjectId, skip, take);
-  }
+  ) {}
 
   @Post('submit-answer')
killedBy: EntryTest - StudyPlan Flow (e2e) should complete full flow: Take Entry Test -> Generate Plan -> Fetch Plan
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/flashcards/flashcards.controller.ts:29:60
   }
 
   @Post('submit-answer')
-  submitAnswer(@Req() req, @Body() body: SubmitAnswerBody) {
-    const userId = req.user.sub;
-    return this.service.submitAnswer(body, userId);
-  }
+  submitAnswer(@Req() req, @Body() body: SubmitAnswerBody) {}
 
   @Get('to-repeat')
killedBy: FlashcardsController submitAnswer should submit an answer and return user progress
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"created_at": 2024-01-01T00:00:00.000Z, "ef": 2.5, "flashcard_id": "flashcard-1", "id": "progress-1", "interval": 1, "nextReview": 2024-01-02T00:00:00.000Z, "repetition": 1, "time_spent": 30, "updated_at": 2024-01-01T00:00:00.000Z, "user_id": "user-1"}
Received: undefined

[Killed] BlockStatement
src/flashcards/flashcards.controller.ts:40:5
     @Query('topicId') topicId?: string,
     @Query('skip') skip: number = 0,
     @Query('take') take: number = DEFAULT_CARDS_TAKE,
-  ) {
-    const userId = req.user.sub;
-    return await this.service.getFlashcardsToRepeat(
-      userId,
-      topicId,
-      skip,
-      take,
-    );
-  }
+  ) {}
 }
 
killedBy: FlashcardsController getFlashcardsToRepeat should return flashcards to repeat without topic filter
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined
