[Killed] BlockStatement
src/notification/notification.controller.ts:9:80
   constructor(private readonly notificationService: NotificationService) {}
 
   @Get(':userId')
-  async getNotificationsByUser(@Param('userId', ParseUUIDPipe) userId: string) {
-    const notifications = await this.notificationService.findLogsByUser(userId);
-
-    if (notifications.length === 0) {
-      return {
-        message: `No notifications found for user ${userId}.`,
-        notifications: [],
-      };
-    }
-
-    return notifications;
-  }
+  async getNotificationsByUser(@Param('userId', ParseUUIDPipe) userId: string) {}
 }
 
killedBy: NotificationController getNotificationsByUser should return logs array when service returns data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "550e8400-e29b-41d4-a716-446655440000"

Number of calls: 0

[Killed] BlockStatement
src/notification/notification.controller.ts:12:37
   async getNotificationsByUser(@Param('userId', ParseUUIDPipe) userId: string) {
     const notifications = await this.notificationService.findLogsByUser(userId);
 
-    if (notifications.length === 0) {
-      return {
-        message: `No notifications found for user ${userId}.`,
-        notifications: [],
-      };
-    }
+    if (notifications.length === 0) {}
 
     return notifications;
killedBy: NotificationController getNotificationsByUser should return formatted message object when logs are empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"message": "No notifications found for user 550e8400-e29b-41d4-a716-446655440000.", "notifications": []}
Received: []

[Killed] EqualityOperator
src/notification/notification.controller.ts:12:9
   async getNotificationsByUser(@Param('userId', ParseUUIDPipe) userId: string) {
     const notifications = await this.notificationService.findLogsByUser(userId);
 
-    if (notifications.length === 0) {
+    if (notifications.length !== 0) {
       return {
         message: `No notifications found for user ${userId}.`,
killedBy: NotificationController getNotificationsByUser should return logs array when service returns data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": "1", "message": "Log 1", "user_id": "550e8400-e29b-41d4-a716-446655440000"}]
Received: {"message": "No notifications found for user 550e8400-e29b-41d4-a716-446655440000.", "notifications": []}

[Killed] ArrayDeclaration
src/notification/notification.controller.ts:15:24
     if (notifications.length === 0) {
       return {
         message: `No notifications found for user ${userId}.`,
-        notifications: [],
+        notifications: ["Stryker was here"],
       };
     }
killedBy: NotificationController getNotificationsByUser should return formatted message object when logs are empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
    "message": "No notifications found for user 550e8400-e29b-41d4-a716-446655440000.",
-   "notifications": Array [],
