[Killed] BlockStatement
src/auth/auth.controller.ts:13:36
 
   @Public()
   @Post('sign-up')
-  signUp(@Body() body: SignUpBody) {
-    return this.auth.signUp(body);
-  }
+  signUp(@Body() body: SignUpBody) {}
 
   @Public()
killedBy: EntryTest - StudyPlan Flow (e2e) should complete full flow: Take Entry Test -> Generate Plan -> Fetch Plan
statusReason: Error: User not found after sign-up

[Killed] BlockStatement
src/auth/auth.controller.ts:19:36
 
   @Public()
   @Post('sign-in')
-  signIn(@Body() body: SignInBody) {
-    return this.auth.signIn(body);
-  }
+  signIn(@Body() body: SignInBody) {}
 
   @Post('logout')
killedBy: AuthController signIn should call authService.signIn and return result
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"access_token": "access_token", "refresh_token": "refresh_token"}
Received: undefined

[Killed] BlockStatement
src/auth/auth.controller.ts:24:22
   }
 
   @Post('logout')
-  logout(@Req() req) {
-    const userId = req.user.sub;
-
-    return this.auth.logout(userId);
-  }
+  logout(@Req() req) {}
 
   @Get('me')
killedBy: AuthController logout should call authService.logout with userId
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user-id"

Number of calls: 0

[Killed] BlockStatement
src/auth/auth.controller.ts:31:21
   }
 
   @Get('me')
-  getMe(@Req() req) {
-    const userId = req.user.sub;
-
-    return this.auth.getMe(userId);
-  }
+  getMe(@Req() req) {}
 
   @Public()
killedBy: Auth E2E 3. getMe
statusReason: Error: expected 200 "OK", got 401 "Unauthorized"

[Killed] BlockStatement
src/auth/auth.controller.ts:40:23
   @Public()
   @UseGuards(RefreshJwtGuard)
   @Post('refresh-tokens')
-  refresh(@Req() req) {
-    const userId = req.user.sub;
-    const userRefreshToken = req.user.refreshToken;
-
-    return this.auth.refreshTokens(userId, userRefreshToken);
-  }
+  refresh(@Req() req) {}
 }
 
killedBy: AuthController refresh should call authService.refreshTokens with userId and refreshToken
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"access_token": "access_token", "refresh_token": "refresh_token"}
Received: undefined
