[Killed] BlockStatement
src/progress_tracker/progress_tracker.controller.ts:19:21
   constructor(private progressTrackerService: ProgressTrackerService) { }
 
   @Get('all-metrix')
-  async getMetrix() {
-    return this.progressTrackerService.getMetrix();
-  }
+  async getMetrix() {}
 
   @Get('metrix/:subjectId')
killedBy: ProgressTrackerController getMetrix should return all metrics
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BlockStatement
src/progress_tracker/progress_tracker.controller.ts:24:74
   }
 
   @Get('metrix/:subjectId')
-  async getMetrixById(@Req() req, @Param('subjectId') subjectId: string) {
-    const userId = req.user.sub;
-    return this.progressTrackerService.getMetrixById(userId, subjectId);
-  }
+  async getMetrixById(@Req() req, @Param('subjectId') subjectId: string) {}
 
   @Post('metrix')
killedBy: ProgressTrackerController (unit) getMetrixById
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user-1", "s1"

Number of calls: 0

[Killed] BlockStatement
src/progress_tracker/progress_tracker.controller.ts:30:61
   }
 
   @Post('metrix')
-  async addMetrix(@Req() req, @Body() body: MetrixBodyType) {
-    const userId = req.user.sub;
-    return this.progressTrackerService.addMetrix(userId, body);
-  }
+  async addMetrix(@Req() req, @Body() body: MetrixBodyType) {}
 
   @Put('metrix/:subjectId')
killedBy: ProgressTracker (e2e) POST /progress-tracker/metrix creates metric
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/progress_tracker/progress_tracker.controller.ts:40:5
     @Req() req,
     @Param('subjectId') subjectId: string,
     @Body() body: MetrixBodyType,
-  ) {
-    const userId = req.user.sub;
-    return this.progressTrackerService.updateMetrix(userId, subjectId, body);
-  }
+  ) {}
 
   @Delete('metrix/:subjectId')
killedBy: ProgressTracker (e2e) PUT /progress-tracker/metrix/:subjectId updates metric
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/progress_tracker/progress_tracker.controller.ts:46:73
   }
 
   @Delete('metrix/:subjectId')
-  async deleteMetrix(@Req() req, @Param('subjectId') subjectId: string) {
-    const userId = req.user.sub;
-    return this.progressTrackerService.deleteMetrix(userId, subjectId);
-  }
+  async deleteMetrix(@Req() req, @Param('subjectId') subjectId: string) {}
 }
 
killedBy: ProgressTrackerController (unit) deleteMetrix
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user-1", "s1"

Number of calls: 0
