[Killed] BlockStatement
src/auth/auth.service.ts:25:69
     private mailService: MailService,
   ) {}
 
-  async sendGreetingEmail({ email, userId }: SendGreetingEmailBody) {
-    await this.mailService.sendMail(
-      {
-        to: email,
-        subject: 'Welcome to UniPrep!',
-        text: 'Thank you for registering.',
-      },
-      'welcome',
-      {
-        userEmail: email,
-        userId: userId,
-      },
-    );
-  }
+  async sendGreetingEmail({ email, userId }: SendGreetingEmailBody) {}
 
   async signUp(body: SignUpBody) {
killedBy: Auth E2E 1. sign-up
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
src/auth/auth.service.ts:29:18
     await this.mailService.sendMail(
       {
         to: email,
-        subject: 'Welcome to UniPrep!',
+        subject: "",
         text: 'Thank you for registering.',
       },

[Killed] ConditionalExpression
src/auth/auth.service.ts:44:9
     const { email, password } = body;
 
     const userExists = await this.prisma.user.findUnique({ where: { email } });
-    if (userExists)
+    if (false)
       throw new ForbiddenException(ERROR_MESSAGES.USER_ALREADY_EXISTS);
 
killedBy: AuthService signUp should throw if user already exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "User already exists"
Received message: "Cannot read properties of undefined (reading 'email')"

       97 |       }));
       98 |       await this.sendGreetingEmail(stryMutAct_9fa48("18") ? {} : (stryCov_9fa48("18"), {
    >  99 |         email: user.email,

[Killed] ConditionalExpression
src/auth/auth.service.ts:44:9
     const { email, password } = body;
 
     const userExists = await this.prisma.user.findUnique({ where: { email } });
-    if (userExists)
+    if (true)
       throw new ForbiddenException(ERROR_MESSAGES.USER_ALREADY_EXISTS);
 
killedBy: StudyPlan (e2e) POST /study-plans/generate-study-plan should analyze results and create plan
statusReason: Error: expected 201 "Created", got 403 "Forbidden"

[Killed] BooleanLiteral
src/auth/auth.service.ts:68:9
     if (!user) throw new NotFoundException(ERROR_MESSAGES.USER_NOT_FOUND);
 
     const matches = await compareValue(password, user.password);
-    if (!matches) throw new ForbiddenException(ERROR_MESSAGES.INVALID_PASSWORD);
+    if (matches) throw new ForbiddenException(ERROR_MESSAGES.INVALID_PASSWORD);
 
     const tokens = await this.generateTokens(user.id, user.email);
killedBy: Auth E2E 2. sign-in
statusReason: Error: expected 201 "Created", got 404 "Not Found"

[Killed] ConditionalExpression
src/auth/auth.service.ts:68:9
     if (!user) throw new NotFoundException(ERROR_MESSAGES.USER_NOT_FOUND);
 
     const matches = await compareValue(password, user.password);
-    if (!matches) throw new ForbiddenException(ERROR_MESSAGES.INVALID_PASSWORD);
+    if (false) throw new ForbiddenException(ERROR_MESSAGES.INVALID_PASSWORD);
 
     const tokens = await this.generateTokens(user.id, user.email);
killedBy: Auth E2E 2. sign-in
statusReason: Error: expected 201 "Created", got 404 "Not Found"

[Killed] ConditionalExpression
src/auth/auth.service.ts:87:9
 
   async getMe(userId: string) {
     const user = await this.prisma.user.findUnique({ where: { id: userId } });
-    if (!user) throw new NotFoundException(ERROR_MESSAGES.USER_NOT_FOUND);
+    if (true) throw new NotFoundException(ERROR_MESSAGES.USER_NOT_FOUND);
 
     return user;
killedBy: Auth E2E 3. getMe
statusReason: PrismaClientInitializationError: Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded

[Killed] ConditionalExpression
src/auth/auth.service.ts:87:9
 
   async getMe(userId: string) {
     const user = await this.prisma.user.findUnique({ where: { id: userId } });
-    if (!user) throw new NotFoundException(ERROR_MESSAGES.USER_NOT_FOUND);
+    if (false) throw new NotFoundException(ERROR_MESSAGES.USER_NOT_FOUND);
 
     return user;
killedBy: Auth E2E 3. getMe
statusReason: PrismaClientInitializationError: Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded

[Killed] BooleanLiteral
src/auth/auth.service.ts:98:9
       throw new ForbiddenException(ERROR_MESSAGES.ACCESS_DENIED);
 
     const matches = await compareValue(refreshToken, user.refresh_token);
-    if (!matches) throw new ForbiddenException(ERROR_MESSAGES.ACCESS_DENIED);
+    if (matches) throw new ForbiddenException(ERROR_MESSAGES.ACCESS_DENIED);
 
     const tokens = await this.generateTokens(user.id, user.email);
killedBy: AuthService refreshTokens should return new tokens if refresh token matches
statusReason: ForbiddenException: Access denied

[Killed] ConditionalExpression
src/auth/auth.service.ts:98:9
       throw new ForbiddenException(ERROR_MESSAGES.ACCESS_DENIED);
 
     const matches = await compareValue(refreshToken, user.refresh_token);
-    if (!matches) throw new ForbiddenException(ERROR_MESSAGES.ACCESS_DENIED);
+    if (false) throw new ForbiddenException(ERROR_MESSAGES.ACCESS_DENIED);
 
     const tokens = await this.generateTokens(user.id, user.email);
killedBy: AuthService refreshTokens should throw if refresh token does not match
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"access_token": "token", "refresh_token": "refresh"}
