[Killed] BooleanLiteral
src/common/decorators/public.decorator.ts:4:56
 import { IS_PUBLIC_KEY } from '@common/constants';
 import { SetMetadata } from '@nestjs/common';
 
-export const Public = () => SetMetadata(IS_PUBLIC_KEY, true);
+export const Public = () => SetMetadata(IS_PUBLIC_KEY, false);
 
killedBy: StudyPlan (e2e) POST /study-plans/generate-study-plan should analyze results and create plan
statusReason: Error: expected 201 "Created", got 401 "Unauthorized"
