[Killed] BlockStatement
src/auth/guards/jwt.guard.ts:18:19
       context.getClass(),
     ]);
 
-    if (isPublic) {
-      return true;
-    }
+    if (isPublic) {}
 
     return super.canActivate(context);
killedBy: StudyPlan (e2e) POST /study-plans/generate-study-plan should analyze results and create plan
statusReason: Error: expected 201 "Created", got 401 "Unauthorized"
