[NoCoverage] BlockStatement
src/db_fill/db_fill.controller.ts:9:19
   constructor(private dbFillService: DbFillService) { }
 
   @Get('all-topic')
-  async findAll() {
-    return await this.dbFillService.findAll();
-  }
+  async findAll() {}
 
   @Post('db-topic-history')

[NoCoverage] BlockStatement
src/db_fill/db_fill.controller.ts:14:23
   }
 
   @Post('db-topic-history')
-  async insertTopic() {
-    return await this.dbFillService.insertTopic();
-  }
+  async insertTopic() {}
 
   @Post('db-task-history')

[NoCoverage] BlockStatement
src/db_fill/db_fill.controller.ts:19:22
   }
 
   @Post('db-task-history')
-  async insertTask() {
-    return await this.dbFillService.insertTask();
-  }
+  async insertTask() {}
 
   @Get('answers-num')

[NoCoverage] BlockStatement
src/db_fill/db_fill.controller.ts:24:22
   }
 
   @Get('answers-num')
-  async answersNum() {
-    return await this.dbFillService.answersInfo();
-  }
+  async answersNum() {}
 
   @Post('subject')

[NoCoverage] BlockStatement
src/db_fill/db_fill.controller.ts:29:54
   }
 
   @Post('subject')
-  async insertSub(@Body() body: { subject: string }) {
-    return await this.dbFillService.insertSub(body.subject);
-  }
+  async insertSub(@Body() body: { subject: string }) {}
 
   @Delete('delete-empty-topics')

[NoCoverage] BlockStatement
src/db_fill/db_fill.controller.ts:34:29
   }
 
   @Delete('delete-empty-topics')
-  async deleteEmptyTopics() {
-    return await this.dbFillService.deleteEmptyTopics();
-  }
+  async deleteEmptyTopics() {}
 
   @Delete('delete-empty-flashcards')

[NoCoverage] BlockStatement
src/db_fill/db_fill.controller.ts:39:33
   }
 
   @Delete('delete-empty-flashcards')
-  async deleteEmptyFlashcards() {
-    return await this.dbFillService.deleteEmptyFlashcards();
-  }
+  async deleteEmptyFlashcards() {}
 
 }
