[Survived] StringLiteral
src/auth/guards/refresh-jwt.guard.ts:5:48
 import { Injectable } from '@nestjs/common';
 
 @Injectable()
-export class RefreshJwtGuard extends AuthGuard('jwt-refresh') {}
+export class RefreshJwtGuard extends AuthGuard("") {}
 
