[Killed] BlockStatement
src/study-plan/study-plan.controller.ts:22:97
 
   //Used by the AI Service (or internal logic) to save a newly generated plan.
   @Post("generate-study-plan")
-  async createStudyPlan(@Body() body: { userId: string, subjectId: string, results: Result[] }) {
-    return this.studyPlanService.createPlan(body)
-  }
+  async createStudyPlan(@Body() body: { userId: string, subjectId: string, results: Result[] }) {}
 
   // Get aLL study plans for the user
killedBy: StudyPlan (e2e) POST /study-plans/generate-study-plan should analyze results and create plan
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "E2E AI Motivation"
Received: undefined

[Killed] BlockStatement
src/study-plan/study-plan.controller.ts:28:35
 
   // Get aLL study plans for the user
   @Get()
-  async getAllMyPlans(@Req() req) {
-    const userId = req.user.sub;
-    return this.studyPlanService.getAllPlansByUser(userId);
-  }
+  async getAllMyPlans(@Req() req) {}
 
   // Get a specific study plan by Subject ID
killedBy: StudyPlanController getAllMyPlans should call service.getAllPlansByUser with userId
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-user-id"

Number of calls: 0

[Killed] BlockStatement
src/study-plan/study-plan.controller.ts:38:5
   async getPlanBySubject(
     @Param('subjectId', ParseUUIDPipe) subjectId: string,
     @Req() req,
-  ) {
-    const userId = req.user.sub;
-    return this.studyPlanService.getPlanBySubject(userId, subjectId);
-  }
+  ) {}
 
   @Patch('topics/:topicId')
killedBy: EntryTest - StudyPlan Flow (e2e) should complete full flow: Take Entry Test -> Generate Plan -> Fetch Plan
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "71ae998f-c6ca-4964-92ef-53df3e66f649"
Received: undefined
