[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:18:19
 export class DbFillService {
   constructor(private prisma: PrismaClient) { }
 
-  async findAll() {
-    return this.prisma.topic.findMany();
-  }
+  async findAll() {}
 
   async insertTopic() {

[NoCoverage] StringLiteral
src/db_fill/db_fill.service.ts:25:15
   async insertTopic() {
     const subject = await this.prisma.subject.findFirst({
       where: {
-        name: 'History',
+        name: "",
       },
     });

[NoCoverage] StringLiteral
src/db_fill/db_fill.service.ts:29:23
       },
     });
     if (!subject) {
-      throw new Error("Subject 'History' not found");
+      throw new Error("");
     }
     const subjectID: string = subject.id;

[NoCoverage] ConditionalExpression
src/db_fill/db_fill.service.ts:34:9
     const subjectID: string = subject.id;
     const topics: string[] = extractTopicsFromHistory(history_data as any);
 
-    if (topics.length == 0) {
+    if (false) {
       return "Error during topics parsing"
     }

[NoCoverage] EqualityOperator
src/db_fill/db_fill.service.ts:34:9
     const subjectID: string = subject.id;
     const topics: string[] = extractTopicsFromHistory(history_data as any);
 
-    if (topics.length == 0) {
+    if (topics.length != 0) {
       return "Error during topics parsing"
     }

[NoCoverage] StringLiteral
src/db_fill/db_fill.service.ts:35:14
     const topics: string[] = extractTopicsFromHistory(history_data as any);
 
     if (topics.length == 0) {
-      return "Error during topics parsing"
+      return ""
     }
 

[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:40:33
 
     const infoToInsert: InfoObj[] = [];
 
-    topics.forEach((elemnet) => {
-      infoToInsert.push({
-        subject_id: subjectID,
-        name: elemnet,
-      });
-    });
+    topics.forEach((elemnet) => {});
 
     await this.prisma.topic.createMany({

[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:58:30
 
     const tempArr: FilteredTask[] = [];
 
-    info.map(async (elem) => {
-      const topic = topics.find((topic: HistoryTopic) => {
-        return topic.name == elem.topic;
-      });
-      if (topic) {
-        try {
-          await this.prisma.flashcard.create({
-            data: {
-              question: elem.question,
-              topic_id: topic.id,
-              answers: {
-                create: elem.answers,
-              },
-            },
-          });
-        } catch (err) {
-          throw err;
-        }
-      } else {
-        tempArr.push(elem);
-      }
-    });
+    info.map(async (elem) => {});
 
     console.log(tempArr.length);

[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:59:58
     const tempArr: FilteredTask[] = [];
 
     info.map(async (elem) => {
-      const topic = topics.find((topic: HistoryTopic) => {
-        return topic.name == elem.topic;
-      });
+      const topic = topics.find((topic: HistoryTopic) => {});
       if (topic) {
         try {

[NoCoverage] ConditionalExpression
src/db_fill/db_fill.service.ts:60:16
 
     info.map(async (elem) => {
       const topic = topics.find((topic: HistoryTopic) => {
-        return topic.name == elem.topic;
+        return false;
       });
       if (topic) {

[NoCoverage] ConditionalExpression
src/db_fill/db_fill.service.ts:60:16
 
     info.map(async (elem) => {
       const topic = topics.find((topic: HistoryTopic) => {
-        return topic.name == elem.topic;
+        return true;
       });
       if (topic) {

[NoCoverage] ConditionalExpression
src/db_fill/db_fill.service.ts:62:11
       const topic = topics.find((topic: HistoryTopic) => {
         return topic.name == elem.topic;
       });
-      if (topic) {
+      if (false) {
         try {
           await this.prisma.flashcard.create({

[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:62:18
       const topic = topics.find((topic: HistoryTopic) => {
         return topic.name == elem.topic;
       });
-      if (topic) {
-        try {
-          await this.prisma.flashcard.create({
-            data: {
-              question: elem.question,
-              topic_id: topic.id,
-              answers: {
-                create: elem.answers,
-              },
-            },
-          });
-        } catch (err) {
-          throw err;
-        }
-      } else {
+      if (topic) {} else {
         tempArr.push(elem);
       }

[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:63:13
         return topic.name == elem.topic;
       });
       if (topic) {
-        try {
-          await this.prisma.flashcard.create({
-            data: {
-              question: elem.question,
-              topic_id: topic.id,
-              answers: {
-                create: elem.answers,
-              },
-            },
-          });
-        } catch (err) {
+        try {} catch (err) {
           throw err;
         }

[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:73:23
               },
             },
           });
-        } catch (err) {
-          throw err;
-        }
+        } catch (err) {}
       } else {
         tempArr.push(elem);

[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:76:14
         } catch (err) {
           throw err;
         }
-      } else {
-        tempArr.push(elem);
-      }
+      } else {}
     });
 

[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:84:23
     console.log(tempArr.length);
   }
 
-  async answersInfo() {
-    const answers = await this.prisma.answer.findMany({
-      include: {
-        Flashcard: {
-          include: {
-            Topic: true,
-          },
-        },
-      },
-    });
-
-    const emptyAnswers = answers.filter((a) => !a.text?.trim());
-
-    const topicsWithNoText = emptyAnswers.map(
-      (a) => a.Flashcard?.Topic?.name ?? 'UNKNOWN',
-    );
-
-    return {
-      answerNum: answers.length,
-      answerNoText: emptyAnswers.length,
-      topicsWithNoText: [...new Set(topicsWithNoText)],
-    };
-  }
+  async answersInfo() {}
 
   async insertSub(subject: string) {

[NoCoverage] ArrowFunction
src/db_fill/db_fill.service.ts:95:41
       },
     });
 
-    const emptyAnswers = answers.filter((a) => !a.text?.trim());
+    const emptyAnswers = answers.filter(() => undefined);
 
     const topicsWithNoText = emptyAnswers.map(

[NoCoverage] MethodExpression
src/db_fill/db_fill.service.ts:95:49
       },
     });
 
-    const emptyAnswers = answers.filter((a) => !a.text?.trim());
+    const emptyAnswers = answers.filter((a) => !a.text);
 
     const topicsWithNoText = emptyAnswers.map(

[NoCoverage] OptionalChaining
src/db_fill/db_fill.service.ts:98:14
     const emptyAnswers = answers.filter((a) => !a.text?.trim());
 
     const topicsWithNoText = emptyAnswers.map(
-      (a) => a.Flashcard?.Topic?.name ?? 'UNKNOWN',
+      (a) => a.Flashcard.Topic?.name ?? 'UNKNOWN',
     );
 

[NoCoverage] LogicalOperator
src/db_fill/db_fill.service.ts:98:14
     const emptyAnswers = answers.filter((a) => !a.text?.trim());
 
     const topicsWithNoText = emptyAnswers.map(
-      (a) => a.Flashcard?.Topic?.name ?? 'UNKNOWN',
+      (a) => a.Flashcard?.Topic?.name && 'UNKNOWN',
     );
 

[NoCoverage] ArrayDeclaration
src/db_fill/db_fill.service.ts:104:25
     return {
       answerNum: answers.length,
       answerNoText: emptyAnswers.length,
-      topicsWithNoText: [...new Set(topicsWithNoText)],
+      topicsWithNoText: [],
     };
   }

[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:108:36
     };
   }
 
-  async insertSub(subject: string) {
-    return await this.prisma.subject.create({
-      data: {
-        name: subject
-      }
-    })
-  }
+  async insertSub(subject: string) {}
 
   async deleteEmptyTopics() {

[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:116:29
     })
   }
 
-  async deleteEmptyTopics() {
-    const deleted = await this.prisma.topic.deleteMany({
-      where: {
-        Flashcard: {
-          none: {}
-        }
-      }
-    });
-
-    return {
-      message: "Empty topics deleted",
-      deleted: deleted.count
-    };
-  }
+  async deleteEmptyTopics() {}
 
   async deleteEmptyFlashcards() {

[NoCoverage] ObjectLiteral
src/db_fill/db_fill.service.ts:117:56
   }
 
   async deleteEmptyTopics() {
-    const deleted = await this.prisma.topic.deleteMany({
-      where: {
-        Flashcard: {
-          none: {}
-        }
-      }
-    });
+    const deleted = await this.prisma.topic.deleteMany({});
 
     return {

[NoCoverage] ObjectLiteral
src/db_fill/db_fill.service.ts:118:14
 
   async deleteEmptyTopics() {
     const deleted = await this.prisma.topic.deleteMany({
-      where: {
-        Flashcard: {
-          none: {}
-        }
-      }
+      where: {}
     });
 

[NoCoverage] BlockStatement
src/db_fill/db_fill.service.ts:131:33
     };
   }
 
-  async deleteEmptyFlashcards() {
-    const deleted = await this.prisma.flashcard.deleteMany({
-      where: {
-        answers: {
-          none: {}
-        }
-      }
-    });
-
-    return {
-      message: "Empty flashcards deleted",
-      deleted: deleted.count
-    };
-  }
+  async deleteEmptyFlashcards() {}
 
 }

[NoCoverage] ObjectLiteral
src/db_fill/db_fill.service.ts:133:14
 
   async deleteEmptyFlashcards() {
     const deleted = await this.prisma.flashcard.deleteMany({
-      where: {
-        answers: {
-          none: {}
-        }
-      }
+      where: {}
     });
 

[NoCoverage] StringLiteral
src/db_fill/db_fill.service.ts:141:16
     });
 
     return {
-      message: "Empty flashcards deleted",
+      message: "",
       deleted: deleted.count
     };
