[Killed] BlockStatement
src/flashcards/flashcards.service.ts:20:5
     topic_id: string,
     skip: number = 0,
     take: number = DEFAULT_CARDS_TAKE,
-  ) {
-    return this.prisma.flashcard.findMany({
-      where: { topic_id },
-      include: { answers: true },
-      skip,
-      take,
-    });
-  }
+  ) {}
 
   async getEntryTestFlashcards(
killedBy: FlashcardsService getFlashcardsByTopic should return flashcards for a given topic
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] BooleanLiteral
src/flashcards/flashcards.service.ts:23:27
   ) {
     return this.prisma.flashcard.findMany({
       where: { topic_id },
-      include: { answers: true },
+      include: { answers: false },
       skip,
       take,
killedBy: FlashcardsService getFlashcardsByTopic should return flashcards for a given topic
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,8 @@
  Object {
    "include": Object {

[Killed] BlockStatement
src/flashcards/flashcards.service.ts:33:5
     subjectId?: string,
     skip: number = 0,
     take: number = ENTRY_TEST_CARDS_NUMBER,
-  ) {
-    let where = {};
-
-    if (subjectId) {
-      where = {
-        Topic: {
-          subject_id: subjectId,
-        },
-      };
-    }
-
-    const flashcards = await this.prisma.flashcard.findMany({
-      where,
-      include: { answers: true },
-    });
-
-    const shuffled = flashcards.sort(() => Math.random() - 0.5);
-
-    return shuffled.slice(skip, skip + take);
-  }
+  ) {}
 
   async submitAnswer(body: SubmitAnswerBody, userId: string) {
killedBy: EntryTest - StudyPlan Flow (e2e) should complete full flow: Take Entry Test -> Generate Plan -> Fetch Plan
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/flashcards/flashcards.service.ts:36:20
   ) {
     let where = {};
 
-    if (subjectId) {
-      where = {
-        Topic: {
-          subject_id: subjectId,
-        },
-      };
-    }
+    if (subjectId) {}
 
     const flashcards = await this.prisma.flashcard.findMany({
killedBy: FlashcardsService getEntryTestFlashcards should filter by subject when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "include": Object {
      "answers": true,

[Killed] ConditionalExpression
src/flashcards/flashcards.service.ts:36:9
   ) {
     let where = {};
 
-    if (subjectId) {
+    if (false) {
       where = {
         Topic: {
killedBy: FlashcardsService getEntryTestFlashcards should filter by subject when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "include": Object {
      "answers": true,

[Killed] ObjectLiteral
src/flashcards/flashcards.service.ts:38:16
 
     if (subjectId) {
       where = {
-        Topic: {
-          subject_id: subjectId,
-        },
+        Topic: {},
       };
     }
killedBy: FlashcardsService getEntryTestFlashcards should filter by subject when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "include": Object {
      "answers": true,

[Killed] BooleanLiteral
src/flashcards/flashcards.service.ts:46:27
 
     const flashcards = await this.prisma.flashcard.findMany({
       where,
-      include: { answers: true },
+      include: { answers: false },
     });
 
killedBy: EntryTest - StudyPlan Flow (e2e) should complete full flow: Take Entry Test -> Generate Plan -> Fetch Plan
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] MethodExpression
src/flashcards/flashcards.service.ts:49:22
       include: { answers: true },
     });
 
-    const shuffled = flashcards.sort(() => Math.random() - 0.5);
+    const shuffled = flashcards;
 
     return shuffled.slice(skip, skip + take);

[Survived] ArithmeticOperator
src/flashcards/flashcards.service.ts:49:44
       include: { answers: true },
     });
 
-    const shuffled = flashcards.sort(() => Math.random() - 0.5);
+    const shuffled = flashcards.sort(() => Math.random() + 0.5);
 
     return shuffled.slice(skip, skip + take);

[Killed] ArithmeticOperator
src/flashcards/flashcards.service.ts:51:33
 
     const shuffled = flashcards.sort(() => Math.random() - 0.5);
 
-    return shuffled.slice(skip, skip + take);
+    return shuffled.slice(skip, skip - take);
   }
 
killedBy: EntryTest - StudyPlan Flow (e2e) should complete full flow: Take Entry Test -> Generate Plan -> Fetch Plan
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] MethodExpression
src/flashcards/flashcards.service.ts:51:12
 
     const shuffled = flashcards.sort(() => Math.random() - 0.5);
 
-    return shuffled.slice(skip, skip + take);
+    return shuffled;
   }
 
killedBy: FlashcardsService getEntryTestFlashcards should apply pagination to shuffled results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 10
Received length: 20

[Killed] ArithmeticOperator
src/flashcards/flashcards.service.ts:75:30
       ? calculateSM2(currentProgress, isCorrect)
       : {};
 
-    const updatedTimeSpent = (currentProgress?.time_spent || 0) + timeSpent;
+    const updatedTimeSpent = (currentProgress?.time_spent || 0) - timeSpent;
 
     const userProgress = await this.prisma.userFlashcardProgress.upsert({
killedBy: FlashcardsService submitAnswer should create new progress for first-time answer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,13 +1,13 @@
  Object {
    "create": Object {

[Killed] ObjectLiteral
src/flashcards/flashcards.service.ts:81:15
       where: {
         user_id_flashcard_id: { user_id: userId, flashcard_id: flashcardId },
       },
-      update: { ...updatedSm2Metrix, time_spent: updatedTimeSpent },
+      update: {},
       create: {
         user_id: userId,
killedBy: FlashcardsService submitAnswer should create new progress for first-time answer
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,13 +2,11 @@
    "create": Object {
      "flashcard_id": "flashcard-1",

[Killed] ArithmeticOperator
src/flashcards/flashcards.service.ts:95:26
       flashcard.Topic.subject_id,
     );
 
-    const newTimeSpent = (progressMetric?.time_spent || 0) + timeSpent;
+    const newTimeSpent = (progressMetric?.time_spent || 0) - timeSpent;
 
     const completedTopics = (progressMetric?.completed_topics || 0) + 1;
killedBy: FlashcardsService submitAnswer should update progress metrics correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user-1",
  "subject-1",
  Object {

[Killed] ArithmeticOperator
src/flashcards/flashcards.service.ts:97:29
 
     const newTimeSpent = (progressMetric?.time_spent || 0) + timeSpent;
 
-    const completedTopics = (progressMetric?.completed_topics || 0) + 1;
+    const completedTopics = (progressMetric?.completed_topics || 0) - 1;
 
     const accuracyRate =
killedBy: FlashcardsService submitAnswer should update progress metrics correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user-1",
  "subject-1",
  Object {

[Killed] ArithmeticOperator
src/flashcards/flashcards.service.ts:100:7
     const completedTopics = (progressMetric?.completed_topics || 0) + 1;
 
     const accuracyRate =
-      ((progressMetric?.accuracy_rate || 0) * (completedTopics - 1) +
-        (isCorrect ? 1 : 0)) /
-      completedTopics;
+      ((progressMetric?.accuracy_rate || 0) * (completedTopics - 1) + (isCorrect ? 1 : 0)) * completedTopics;
 
     await this.progress_tracker.updateMetrix(
killedBy: FlashcardsService submitAnswer should update progress metrics correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user-1",
  "subject-1",
  Object {

[Killed] ArithmeticOperator
src/flashcards/flashcards.service.ts:100:8
     const completedTopics = (progressMetric?.completed_topics || 0) + 1;
 
     const accuracyRate =
-      ((progressMetric?.accuracy_rate || 0) * (completedTopics - 1) +
+      ((progressMetric?.accuracy_rate || 0) / (completedTopics - 1) +
         (isCorrect ? 1 : 0)) /
       completedTopics;
killedBy: FlashcardsService submitAnswer should update progress metrics correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "user-1",
  "subject-1",
  Object {

[Killed] BlockStatement
src/flashcards/flashcards.service.ts:122:5
     topicId?: string,
     skip: number = 0,
     take: number = DEFAULT_CARDS_TAKE,
-  ) {
-    const today = new Date();
-
-    const progresses = await this.prisma.userFlashcardProgress.findMany({
-      where: {
-        user_id: userId,
-        Flashcard: topicId ? { topic_id: topicId } : undefined,
-        nextReview: { lte: today },
-      },
-      include: { Flashcard: { include: { answers: true } } },
-      skip,
-      take,
-      orderBy: { nextReview: 'asc' },
-    });
-
-    return progresses.map((p) => ({
-      ...p.Flashcard,
-      interval: p.interval,
-      repetition: p.repetition,
-      ef: p.ef,
-      nextReview: p.nextReview,
-    }));
-  }
+  ) {}
 }
 
killedBy: FlashcardsService getFlashcardsToRepeat should return flashcards due for review
statusReason: TypeError: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ObjectLiteral
src/flashcards/flashcards.service.ts:126:14
     const today = new Date();
 
     const progresses = await this.prisma.userFlashcardProgress.findMany({
-      where: {
-        user_id: userId,
-        Flashcard: topicId ? { topic_id: topicId } : undefined,
-        nextReview: { lte: today },
-      },
+      where: {},
       include: { Flashcard: { include: { answers: true } } },
       skip,
killedBy: FlashcardsService getFlashcardsToRepeat should return flashcards due for review
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -9,13 +9,7 @@
    "orderBy": Object {
      "nextReview": "asc",

[Killed] BooleanLiteral
src/flashcards/flashcards.service.ts:131:51
         Flashcard: topicId ? { topic_id: topicId } : undefined,
         nextReview: { lte: today },
       },
-      include: { Flashcard: { include: { answers: true } } },
+      include: { Flashcard: { include: { answers: false } } },
       skip,
       take,
killedBy: FlashcardsService getFlashcardsToRepeat should return flashcards due for review
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "include": Object {

[Killed] ArrowFunction
src/flashcards/flashcards.service.ts:137:27
       orderBy: { nextReview: 'asc' },
     });
 
-    return progresses.map((p) => ({
-      ...p.Flashcard,
-      interval: p.interval,
-      repetition: p.repetition,
-      ef: p.ef,
-      nextReview: p.nextReview,
-    }));
+    return progresses.map(() => undefined);
   }
 }
killedBy: FlashcardsService getFlashcardsToRepeat should return flashcards due for review
statusReason: Error: expect(received).toMatchObject(expected)

Matcher error: received value must be a non-null object

Received has value: undefined

[Killed] ObjectLiteral
src/flashcards/flashcards.service.ts:137:35
       orderBy: { nextReview: 'asc' },
     });
 
-    return progresses.map((p) => ({
-      ...p.Flashcard,
-      interval: p.interval,
-      repetition: p.repetition,
-      ef: p.ef,
-      nextReview: p.nextReview,
-    }));
+    return progresses.map((p) => ({}));
   }
 }
killedBy: FlashcardsService getFlashcardsToRepeat should return flashcards due for review
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 25
+ Received  +  1

- Object {
-   "answers": Array [
-     Object {
