[Killed] ArrowFunction
src/study-plan/study-plan.service.ts:37:41
       },
     });
 
-    const wrongAnswers = answers.filter((a) => !a.isCorrect);
+    const wrongAnswers = answers.filter(() => undefined);
 
     const correctTaskNum = taskNum - wrongAnswers.length;
killedBy: StudyPlanService createPlan (AI Flow) should analyze wrong answers, call AI, and save plan via PlanTopics relation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "correctTaskNum": 1,
+   "correctTaskNum": 2,

[Killed] MethodExpression
src/study-plan/study-plan.service.ts:37:26
       },
     });
 
-    const wrongAnswers = answers.filter((a) => !a.isCorrect);
+    const wrongAnswers = answers;
 
     const correctTaskNum = taskNum - wrongAnswers.length;
killedBy: StudyPlanService createPlan (AI Flow) should analyze wrong answers, call AI, and save plan via PlanTopics relation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "correctTaskNum": 1,
+   "correctTaskNum": 0,

[Killed] ArithmeticOperator
src/study-plan/study-plan.service.ts:39:28
 
     const wrongAnswers = answers.filter((a) => !a.isCorrect);
 
-    const correctTaskNum = taskNum - wrongAnswers.length;
+    const correctTaskNum = taskNum + wrongAnswers.length;
 
     const wrongTopicsMap = new Map<string, TopicObj>();
killedBy: StudyPlanService createPlan (AI Flow) should analyze wrong answers, call AI, and save plan via PlanTopics relation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "correctTaskNum": 1,
+   "correctTaskNum": 3,

[NoCoverage] BlockStatement
src/study-plan/study-plan.service.ts:72:17
       if (text) {
         try {
           analysedTopics = JSON.parse(text);
-        } catch {
-          analysedTopics = wrongTopics;
-        }
+        } catch {}
       }
     }

[Survived] ArrayDeclaration
src/study-plan/study-plan.service.ts:78:33
       }
     }
 
-    const studyPlan: string[] = [];
+    const studyPlan: string[] = ["Stryker was here"];
     analysedTopics.forEach((elem) => {
       studyPlan.push(elem.topicId);

[Killed] ObjectLiteral
src/study-plan/study-plan.service.ts:97:12
       },
     });
 
-    return {
-      message,
-      topics: analysedTopics,
-    };
+    return {};
 
     return {
killedBy: StudyPlanService createPlan (AI Flow) should analyze wrong answers, call AI, and save plan via PlanTopics relation
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- Object {
-   "message": "Good job!",
-   "topics": Array [

[NoCoverage] ObjectLiteral
src/study-plan/study-plan.service.ts:102:12
       topics: analysedTopics,
     };
 
-    return {
-      message,
-      topics: studyPlan,
-    };
+    return {};
   }
 

[Killed] BlockStatement
src/study-plan/study-plan.service.ts:122:45
       throw new NotFoundException(`Topic with ID ${topicId} not found`);
     }
 
-    if (topic.StudyPlan.user_id !== userId) {
-      throw new ForbiddenException(
-        'You do not have permission to update this topic.',
-      );
-    }
+    if (topic.StudyPlan.user_id !== userId) {}
 
     return this.prisma.planTopic.update({
killedBy: StudyPlan Service Integration (DB Logic) updateTopicStatus (Security & Logic) should FORBID another user from updating the status
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Killed] ConditionalExpression
src/study-plan/study-plan.service.ts:122:9
       throw new NotFoundException(`Topic with ID ${topicId} not found`);
     }
 
-    if (topic.StudyPlan.user_id !== userId) {
+    if (false) {
       throw new ForbiddenException(
         'You do not have permission to update this topic.',
killedBy: StudyPlan Service Integration (DB Logic) updateTopicStatus (Security & Logic) should allow the OWNER to update status
statusReason: PrismaClientInitializationError: 
Invalid `prisma.userFlashcardProgress.deleteMany()` invocation:


Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded

[Survived] StringLiteral
src/study-plan/study-plan.service.ts:124:9
 
     if (topic.StudyPlan.user_id !== userId) {
       throw new ForbiddenException(
-        'You do not have permission to update this topic.',
+        "",
       );
     }

[Killed] ObjectLiteral
src/study-plan/study-plan.service.ts:130:13
 
     return this.prisma.planTopic.update({
       where: { id: topicId },
-      data: { status },
+      data: {},
     });
   }
killedBy: StudyPlan Service Integration (DB Logic) updateTopicStatus (Security & Logic) should allow the OWNER to update status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "COMPLETED"
Received: "PENDING"

[Killed] BlockStatement
src/study-plan/study-plan.service.ts:134:43
     });
   }
 
-  async getAllPlansByUser(userId: string) {
-    return this.prisma.studyPlan.findMany({
-      where: { user_id: userId },
-      orderBy: { xata_createdat: 'desc' },
-      include: {
-        Subject: true,
-      },
-    });
-  }
+  async getAllPlansByUser(userId: string) {}
 
   async getPlanBySubject(userId: string, subjectId: string) {
killedBy: StudyPlanService Get Plans getAllPlansByUser should return plans
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["plan1"]
Received: undefined

[Survived] ObjectLiteral
src/study-plan/study-plan.service.ts:136:14
 
   async getAllPlansByUser(userId: string) {
     return this.prisma.studyPlan.findMany({
-      where: { user_id: userId },
+      where: {},
       orderBy: { xata_createdat: 'desc' },
       include: {

[Survived] BooleanLiteral
src/study-plan/study-plan.service.ts:139:18
       where: { user_id: userId },
       orderBy: { xata_createdat: 'desc' },
       include: {
-        Subject: true,
+        Subject: false,
       },
     });

[Killed] BlockStatement
src/study-plan/study-plan.service.ts:144:61
     });
   }
 
-  async getPlanBySubject(userId: string, subjectId: string) {
-    const plan = await this.prisma.studyPlan.findFirst({
-      where: {
-        user_id: userId,
-        subject_id: subjectId,
-      },
-      include: {
-        PlanTopics: {
-          orderBy: { name: 'asc' },
-        },
-        Subject: true,
-      },
-    });
-
-    if (!plan) {
-      throw new NotFoundException(
-        `No study plan found for subject ${subjectId}`,
-      );
-    }
-
-    return plan;
-  }
+  async getPlanBySubject(userId: string, subjectId: string) {}
 }
 
killedBy: EntryTest - StudyPlan Flow (e2e) should complete full flow: Take Entry Test -> Generate Plan -> Fetch Plan
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "57a7b213-f56e-44e9-9cd0-16723bfc7a97"
Received: undefined

[Killed] BlockStatement
src/study-plan/study-plan.service.ts:158:16
       },
     });
 
-    if (!plan) {
-      throw new NotFoundException(
-        `No study plan found for subject ${subjectId}`,
-      );
-    }
+    if (!plan) {}
 
     return plan;
killedBy: StudyPlanService Get Plans getPlanBySubject should throw NotFound if not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: null
