[NoCoverage] ArithmeticOperator
flashcards/utils/calculateSM2/calculateSM2.ts:41:16
 
   const q = isCorrect ? SM2_CORRECT_QUALITY : SM2_INCORRECT_QUALITY;
 
-  const diff = SM2_CORRECT_QUALITY - q;
+  const diff = SM2_CORRECT_QUALITY + q;
 
   const newEF = Math.max(1.3, ef + (0.1 - diff * (0.08 + diff * 0.02)));

[NoCoverage] ArithmeticOperator
flashcards/utils/calculateSM2/calculateSM2.ts:43:37
 
   const diff = SM2_CORRECT_QUALITY - q;
 
-  const newEF = Math.max(1.3, ef + (0.1 - diff * (0.08 + diff * 0.02)));
+  const newEF = Math.max(1.3, ef + (0.1 + diff * (0.08 + diff * 0.02)));
 
   const newRepetition = q < 3 ? 0 : repetition + 1;

[NoCoverage] ArithmeticOperator
flashcards/utils/calculateSM2/calculateSM2.ts:43:51
 
   const diff = SM2_CORRECT_QUALITY - q;
 
-  const newEF = Math.max(1.3, ef + (0.1 - diff * (0.08 + diff * 0.02)));
+  const newEF = Math.max(1.3, ef + (0.1 - diff * (0.08 - diff * 0.02)));
 
   const newRepetition = q < 3 ? 0 : repetition + 1;

[NoCoverage] EqualityOperator
flashcards/utils/calculateSM2/calculateSM2.ts:45:25
 
   const newEF = Math.max(1.3, ef + (0.1 - diff * (0.08 + diff * 0.02)));
 
-  const newRepetition = q < 3 ? 0 : repetition + 1;
+  const newRepetition = q <= 3 ? 0 : repetition + 1;
 
   const newInterval =

[NoCoverage] ArithmeticOperator
flashcards/utils/calculateSM2/calculateSM2.ts:45:37
 
   const newEF = Math.max(1.3, ef + (0.1 - diff * (0.08 + diff * 0.02)));
 
-  const newRepetition = q < 3 ? 0 : repetition + 1;
+  const newRepetition = q < 3 ? 0 : repetition - 1;
 
   const newInterval =

[NoCoverage] ConditionalExpression
flashcards/utils/calculateSM2/calculateSM2.ts:48:5
   const newRepetition = q < 3 ? 0 : repetition + 1;
 
   const newInterval =
-    newRepetition === 0
+    true
       ? 1
       : newRepetition === 1

[NoCoverage] ConditionalExpression
flashcards/utils/calculateSM2/calculateSM2.ts:48:5
   const newRepetition = q < 3 ? 0 : repetition + 1;
 
   const newInterval =
-    newRepetition === 0
+    false
       ? 1
       : newRepetition === 1

[NoCoverage] ConditionalExpression
flashcards/utils/calculateSM2/calculateSM2.ts:50:9
   const newInterval =
     newRepetition === 0
       ? 1
-      : newRepetition === 1
+      : true
         ? 1
         : newRepetition === 2

[NoCoverage] ConditionalExpression
flashcards/utils/calculateSM2/calculateSM2.ts:50:9
   const newInterval =
     newRepetition === 0
       ? 1
-      : newRepetition === 1
+      : false
         ? 1
         : newRepetition === 2

[NoCoverage] ConditionalExpression
flashcards/utils/calculateSM2/calculateSM2.ts:52:11
       ? 1
       : newRepetition === 1
         ? 1
-        : newRepetition === 2
+        : false
           ? 6
           : Math.round(interval * newEF);

[NoCoverage] EqualityOperator
flashcards/utils/calculateSM2/calculateSM2.ts:52:11
       ? 1
       : newRepetition === 1
         ? 1
-        : newRepetition === 2
+        : newRepetition !== 2
           ? 6
           : Math.round(interval * newEF);

[NoCoverage] ArithmeticOperator
flashcards/utils/calculateSM2/calculateSM2.ts:54:24
         ? 1
         : newRepetition === 2
           ? 6
-          : Math.round(interval * newEF);
+          : Math.round(interval / newEF);
 
   const nextReview = new Date(

[NoCoverage] ArithmeticOperator
flashcards/utils/calculateSM2/calculateSM2.ts:57:5
           : Math.round(interval * newEF);
 
   const nextReview = new Date(
-    Date.now() +
-      newInterval *
-        DAY_IN_HOURS *
-        HOUR_IN_MINUTES *
-        MINUTE_IN_SECONDS *
-        SECOND_IN_MILLISECONDS,
+    Date.now() - newInterval * DAY_IN_HOURS * HOUR_IN_MINUTES * MINUTE_IN_SECONDS * SECOND_IN_MILLISECONDS,
   );
 

[NoCoverage] ArithmeticOperator
flashcards/utils/calculateSM2/calculateSM2.ts:58:7
 
   const nextReview = new Date(
     Date.now() +
-      newInterval *
-        DAY_IN_HOURS *
-        HOUR_IN_MINUTES *
+      newInterval * DAY_IN_HOURS / HOUR_IN_MINUTES *
         MINUTE_IN_SECONDS *
         SECOND_IN_MILLISECONDS,

[NoCoverage] ArithmeticOperator
flashcards/utils/calculateSM2/calculateSM2.ts:58:7
 
   const nextReview = new Date(
     Date.now() +
-      newInterval *
-        DAY_IN_HOURS *
-        HOUR_IN_MINUTES *
-        MINUTE_IN_SECONDS *
+      newInterval * DAY_IN_HOURS * HOUR_IN_MINUTES / MINUTE_IN_SECONDS *
         SECOND_IN_MILLISECONDS,
   );
