[Killed] BlockStatement
src/progress_tracker/progress_tracker.service.ts:29:57
     return metric;
   }
 
-  async addMetrix(userId: string, body: MetrixBodyType) {
-    const metricExists = await this.prisma.progress.findUnique({
-      where: {
-        user_id_subject_id: { user_id: userId, subject_id: body.subject_id },
-      },
-    });
-
-    if (metricExists) {
-      throw new ForbiddenException(ERROR_MESSAGES.METRIC_ALREADY_EXISTS);
-    }
-
-    const newMetric = await this.prisma.progress.create({
-      data: { user_id: userId, ...body },
-    });
-
-    return newMetric;
-  }
+  async addMetrix(userId: string, body: MetrixBodyType) {}
 
   async updateMetrix(
killedBy: ProgressTrackerService (integration) creates metric in DB
statusReason: PrismaClientInitializationError: 
Invalid `prisma.progress.deleteMany()` invocation:


Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded

[Killed] ConditionalExpression
src/progress_tracker/progress_tracker.service.ts:36:9
       },
     });
 
-    if (metricExists) {
+    if (false) {
       throw new ForbiddenException(ERROR_MESSAGES.METRIC_ALREADY_EXISTS);
     }
killedBy: ProgressTracker (e2e) POST /progress-tracker/metrix creates metric
statusReason: PrismaClientInitializationError: Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded

[Killed] ConditionalExpression
src/progress_tracker/progress_tracker.service.ts:36:9
       },
     });
 
-    if (metricExists) {
+    if (true) {
       throw new ForbiddenException(ERROR_MESSAGES.METRIC_ALREADY_EXISTS);
     }
killedBy: ProgressTracker (e2e) POST /progress-tracker/metrix creates metric
statusReason: PrismaClientInitializationError: Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded

[Killed] BlockStatement
src/progress_tracker/progress_tracker.service.ts:51:5
     userId: string,
     subjectId: string,
     body: Omit<Metrix, 'id' | 'updated_at' | 'user_id' | 'subject_id'>,
-  ) {
-    const updatedMetric = await this.prisma.progress.upsert({
-      where: {
-        user_id_subject_id: {
-          user_id: userId,
-          subject_id: subjectId,
-        },
-      },
-      update: { user_id: userId, subject_id: subjectId, ...body },
-      create: { user_id: userId, subject_id: subjectId, ...body },
-    });
-
-    return updatedMetric;
-  }
+  ) {}
 
   async deleteMetrix(userId: string, subjectId: string) {
killedBy: ProgressTracker (e2e) PUT /progress-tracker/metrix/:subjectId updates metric
statusReason: PrismaClientInitializationError: Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded
