[NoCoverage] BlockStatement
src/main.ts:6:28
 import { AllExceptionsFilter } from '@common/filters';
 import { ValidationPipe } from '@nestjs/common';
 
-async function bootstrap() {
-  const app = await NestFactory.create(AppModule);
-
-  const globalFilters = new AllExceptionsFilter();
-  app.useGlobalFilters(globalFilters);
-  app.useGlobalPipes(new ValidationPipe({ transform: true, whitelist: true }));
-
-  await app.listen(process.env.PORT as string);
-}
+async function bootstrap() {}
 void bootstrap();
 

[NoCoverage] BooleanLiteral
src/main.ts:11:54
 
   const globalFilters = new AllExceptionsFilter();
   app.useGlobalFilters(globalFilters);
-  app.useGlobalPipes(new ValidationPipe({ transform: true, whitelist: true }));
+  app.useGlobalPipes(new ValidationPipe({ transform: false, whitelist: true }));
 
   await app.listen(process.env.PORT as string);

[NoCoverage] BooleanLiteral
src/main.ts:11:71
 
   const globalFilters = new AllExceptionsFilter();
   app.useGlobalFilters(globalFilters);
-  app.useGlobalPipes(new ValidationPipe({ transform: true, whitelist: true }));
+  app.useGlobalPipes(new ValidationPipe({ transform: true, whitelist: false }));
 
   await app.listen(process.env.PORT as string);
