[Killed] StringLiteral
src/mail/mail.service.ts:29:50
     this.transporter = nodemailer.createTransport(mailConfig);
     this.templateTransporter = nodemailer.createTransport(mailConfig);
 
-    const viewsPath = join(process.cwd(), 'src', 'mail', 'templates');
+    const viewsPath = join(process.cwd(), 'src', "", 'templates');
     console.log('Template View Path:', viewsPath);
 
killedBy: ProgressTracker (e2e) POST /progress-tracker/metrix creates metric
statusReason: Error: expected 201 "Created", got 500 "Internal Server Error"

[Killed] BooleanLiteral
src/mail/mail.service.ts:38:26
         viewEngine: {
           extName: '.hbs',
           partialsDir: viewsPath,
-          defaultLayout: false,
+          defaultLayout: true,
         },
         viewPath: viewsPath,
killedBy: ProgressTracker (e2e) POST /progress-tracker/metrix creates metric
statusReason: PrismaClientKnownRequestError: 
Invalid `prisma.subject.deleteMany()` invocation:


Foreign key constraint violated on the constraint: `Topic_subject_id_fkey`

[Killed] BlockStatement
src/mail/mail.service.ts:61:9
 
     let info;
 
-    try {
-      if (template) {
-        // Template Transporter if a template is provided
-        mailOptions.template = template;
-        mailOptions.context = context;
-        info = await this.templateTransporter.sendMail(mailOptions);
-      } else {
-        // Generic Transporter for plain emails
-        info = await this.transporter.sendMail(mailOptions);
-      }
-
-      console.log('Email sent:', info.messageId);
-
-      await this.notificationService.createLog({
-        user_id: context.userId,
-        message: `Email successfully sent: ${options.subject}`,
-      });
-
-      return info;
-    } catch (error) {
+    try {} catch (error) {
       console.error('Mail Service Error:', error);
 
killedBy: ProgressTracker (e2e) POST /progress-tracker/metrix creates metric
statusReason: Error: expected 201 "Created", got 500 "Internal Server Error"

[Killed] ConditionalExpression
src/mail/mail.service.ts:62:11
     let info;
 
     try {
-      if (template) {
+      if (false) {
         // Template Transporter if a template is provided
         mailOptions.template = template;
killedBy: ProgressTracker (e2e) POST /progress-tracker/metrix creates metric
statusReason: Error: expected 201 "Created", got 500 "Internal Server Error"

[Killed] BlockStatement
src/mail/mail.service.ts:67:14
         mailOptions.template = template;
         mailOptions.context = context;
         info = await this.templateTransporter.sendMail(mailOptions);
-      } else {
-        // Generic Transporter for plain emails
-        info = await this.transporter.sendMail(mailOptions);
-      }
+      } else {}
 
       console.log('Email sent:', info.messageId);
killedBy: Mail & Notification Integration Email Sending Flow should send an email and automatically create a SUCCESS notification in DB
statusReason: InternalServerErrorException: Failed to send email.

[Killed] BlockStatement
src/mail/mail.service.ts:80:21
       });
 
       return info;
-    } catch (error) {
-      console.error('Mail Service Error:', error);
-
-      await this.notificationService.createLog({
-        user_id: context.userId,
-        message: `Email FAILED (${error.code || 'SMTP_ERROR'}): ${options.subject}`,
-      });
-
-      throw new InternalServerErrorException('Failed to send email.');
-    }
+    } catch (error) {}
   }
 }
killedBy: Mail & Notification Integration Email Sending Flow should handle SMTP errors and automatically create a FAILURE notification in DB
statusReason: PrismaClientInitializationError: 
Invalid `prisma.notification.deleteMany()` invocation:


Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded

[Killed] StringLiteral
src/mail/mail.service.ts:81:21
 
       return info;
     } catch (error) {
-      console.error('Mail Service Error:', error);
+      console.error("", error);
 
       await this.notificationService.createLog({
killedBy: Mail & Notification Integration Email Sending Flow should handle SMTP errors and automatically create a FAILURE notification in DB
statusReason: PrismaClientInitializationError: 
Invalid `prisma.notification.deleteMany()` invocation:


Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded

[Killed] ConditionalExpression
src/mail/mail.service.ts:85:35
 
       await this.notificationService.createLog({
         user_id: context.userId,
-        message: `Email FAILED (${error.code || 'SMTP_ERROR'}): ${options.subject}`,
+        message: `Email FAILED (${true}): ${options.subject}`,
       });
 
killedBy: Mail & Notification Integration Email Sending Flow should handle SMTP errors and automatically create a FAILURE notification in DB
statusReason: PrismaClientInitializationError: 
Invalid `prisma.notification.deleteMany()` invocation:


Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded

[Killed] ConditionalExpression
src/mail/mail.service.ts:85:35
 
       await this.notificationService.createLog({
         user_id: context.userId,
-        message: `Email FAILED (${error.code || 'SMTP_ERROR'}): ${options.subject}`,
+        message: `Email FAILED (${false}): ${options.subject}`,
       });
 
killedBy: Mail & Notification Integration Email Sending Flow should handle SMTP errors and automatically create a FAILURE notification in DB
statusReason: PrismaClientInitializationError: 
Invalid `prisma.notification.deleteMany()` invocation:


Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded

[Killed] StringLiteral
src/mail/mail.service.ts:88:46
         message: `Email FAILED (${error.code || 'SMTP_ERROR'}): ${options.subject}`,
       });
 
-      throw new InternalServerErrorException('Failed to send email.');
+      throw new InternalServerErrorException("");
     }
   }
killedBy: Mail & Notification Integration Email Sending Flow should handle SMTP errors and automatically create a FAILURE notification in DB
statusReason: PrismaClientInitializationError: 
Invalid `prisma.notification.deleteMany()` invocation:


Error querying the database: ERROR: branch [uniprep:db-copy]: concurrent connections limit exceeded
