[Killed] ObjectLiteral
src/notification/notification.service.ts:23:46
   }
 
   async findLogsByUser(userId: string) {
-    return this.prisma.notification.findMany({
-      where: { user_id: userId },
-      orderBy: { send_at: 'desc' },
-    });
+    return this.prisma.notification.findMany({});
   }
 }
killedBy: NotificationService findLogsByUser should return an array of logs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "orderBy": Object {
-     "send_at": "desc",
